{
  "navbar": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "changeTheme": {
      "title": "Change theme",
      "light": "Light",
      "dark": "Dark",
      "pink": "Pink",
      "system": "System"
    },
    "changeLanguage": {
      "title": "Change Language",
      "en": "English",
      "nl": "Dutch"
    }
  },
  "index": {
    "header": {
      "title": {
        "section1": "Welcome to",
        "section2": "personal website!"
      },
      "slogan": "Hello there! I'm Simon Stijnen, a passionate developer based in Belgium. Welcome to my digital space."
    },
    "section1": {
      "title": "Get to know me",
      "text_1": "I'm a",
      "text_2": "year old developer from Belgium. I'm currently studying at Vives Brugge.",
      "button": "Get to know me"
    },
    "section2": {
      "title": "Showcasing websites of my talented friends. Explore their work!",
      "text": "I'm currently working on a few projects. You can find them all on my Github page.",
      "accordion": {
        "maxim": "is a friend of mine who is also a developer. He is currently studying at Odisee in Ghent.",
        "joe1": "Meet ",
        "joe2": ", my study buddy at Vives Bruges."
      },
      "footer": "They are really talented and I'm proud to call them my friends."
    },
    "section3": {
      "title": "",
      "text": "Feel free to browse around, and don't hesitate to get in touch. I'm always eager to connect with like-minded individuals and explore new opportunities. Thank you for visiting, and I hope you enjoy your stay!"
    }
  },
  "about": {
    "section1": {
      "title": "Personal information",
      "birthday": "23 march 2005",
      "livingIn": "Living in Belgium",
      "studies": "Currently studying Bachelor Elektronics − ICT at Vives",
      "hobby": "Icehockey player @"
    },
    "section2": {
      "title": "Education",
      "studies": [
        {
          "date": "2023 − Present",
          "text": "Bachelor Elektronics − ICT at Vives"
        },
        {
          "date": "2022 − 2023",
          "text": "Programming@home at Howest"
        },
        {
          "date": "2021 − 2023",
          "text": "Diploma secundair Industriële ICT at KTA Brugge"
        },
        {
          "date": "2019 − 2021",
          "text": "Science Math at Sint-Jozef Humaniora"
        },
        {
          "date": "2017 − 2019",
          "text": "Science STEM at Sint-Pieter Oostkamp"
        }
      ]
    },
    "section3": {
      "title": "Experience",
      "list": [
        {
          "date": "May 2023",
          "text": "Internship - 2 weeks",
          "description": "For my internship in the 6th year of high school, I interned at Advionics. Here, I created a program that automatically takes pictures of the product using three different cameras just before it gets packed for shipping. The photos are then saved in a PDF on a server. For this, I used Python and OpenCV for image processing. I didn't learn either at school, but I taught myself."
        },
        {
          "date": "Summer 2023",
          "text": "Student Job",
          "description": "For my student job, I worked at Advionics. Here, I helped measure their machines that calibrate equipment. For example, I measured the margin of error for each machine."
        },
        {
          "date": "May 2024",
          "text": "Student Job",
          "description": "In this student job, I again worked at Advionics. I was tasked with reading multiple heat sensors and taking certain actions if the temperature was too high or too low. I wrote a program for this in Python.",
          "link": {
            "text": "More information",
            "url": "https://github.com/SimonStnn/mlx90640"
          }
        },
        {
          "date": "Summer 2024",
          "text": "Student Job",
          "description": "I worked again at Advionics. Here, I helped rewrite their test software. It was written in Python using Flask. I also ensured this project was containerized with Docker."
        }
      ]
    }
  },
  "projects": {
    "title": "Projects",
    "text": {
      "intro": "Here are some projects I've worked on. Some of them are open source, others are not.",
      "end": "I mostly work on larger projects, most of them included here. I also build smaller projects, but I don't share them here."
    },
    "card": {
      "popaloon": {
        "content1": "\"Pop-a-loon\" is a Chrome extension that I built that occasionally lets a balloon float across the screen. When you click on the balloon, it pops and disappears. The amount of balloons you've popped is displayed in the extension's popup.",
        "content2": "The extension's popup also contains a leaderboard, where you can see the top 10 balloon poppers."
      },
      "popaloonBackend": {
        "content1": "This is the backend API for the Pop-a-loon Chrome extension. It's built with Node.js and Express. It uses a MongoDB database to store the amount of balloons popped by each user.",
        "content2": "I'm hosting and managing the server myself. The server is behind a reverse proxy, which is managed by Nginx."
      },
      "finalProject": {
        "title": "Final Project",
        "content": "For my final project in high school (2022 - 2023), I built a bluetooth detection system that can locate bluetooth devices in a room. Detected devices get send via http to a server (Raspberry Pi). The server then calculates the location of the found device in a room. This information is then displayed via websocket in a React app. It has an advanced structure to make it easy to add new features."
      },
      "discordBot": {
        "title": "Discord Bot",
        "content": "I built a discord bot with node.js and discord.js. It's written in TypeScript and uses a MongoDB database."
      },
      "colorsplash": {
        "content": "A simple API that returns an image of the requested color and size."
      },
      "oddAndEven": {
        "odd": {
          "content": "A go package that checks whether a given number is odd."
        },
        "even": {
          "content": "A go package that checks whether a given number is even."
        }
      },
      "other": {
        "title": "Other Projects",
        "content": "I've also build some closed source projects, but I cannot share them here. I've made a prometheus exporter, that pushes to grafana. I'm also working on an API. It also saves the pictures and other neseccary data in a pdf."
      }
    }
  }
}
