{
  "navbar": {
    "home": "Home",
    "about": "Over mij",
    "projects": "Projecten",
    "changeTheme": {
      "title": "Verander thema",
      "light": "Licht",
      "dark": "Donker",
      "pink": "Roze",
      "system": "Systeem"
    },
    "changeLanguage": {
      "title": "Verander taal",
      "en": "Engels",
      "nl": "Nederlands"
    }
  },
  "index": {
    "header": {
      "title": {
        "section1": "Welkom op",
        "section2": "persoonlijke website!"
      },
      "slogan": "Hallo daar! Ik ben Simon Stijnen, een gepassioneerde ontwikkelaar gevestigd in België."
    },
    "section1": {
      "title": "Leer mij kennen",
      "text_1": "Ik ben een ",
      "text_2": "- jarige ontwikkelaar uit België. Momenteel studeer ik aan Vives Brugge.",
      "button": "Leer mij kennen"
    },
    "section2": {
      "title": "Websites van mijn getalenteerde vrienden presenteren. Ontdek hun werk!",
      "text": "Momenteel ben ik bezig met een aantal projecten. Je kunt ze allemaal vinden op mijn Github-pagina.",
      "accordion": {
        "maxim": "is een vriend van mij die ook ontwikkelaar is. Momenteel studeert hij aan Odisee in Gent.",
        "joe1": "Maak kennis met ",
        "joe2": ", mijn studiemaatje aan Vives Brugge."
      },
      "footer": "Ze zijn echt getalenteerd en ik ben er trots op dat ik ze mijn vrienden mag noemen."
    },
    "section3": {
      "title": "",
      "text": "Kijk gerust eens rond en neem gerust contact met ons op. Ik wil altijd graag in contact komen met gelijkgestemde individuen en nieuwe kansen verkennen. Bedankt voor uw bezoek, en ik hoop dat u geniet van uw verblijf!"
    }
  },
  "about": {
    "section1": {
      "title": "Persoonlijke informatie",
      "birthday": "23 maart 2005",
      "livingIn": "Komt uit België",
      "studies": "Momenteel een Bachelor Elektronica − ICT aan het studeren in Vives",
      "hobby": "Ijshockey speler @"
    },
    "section2": {
      "title": "Studies",
      "studies": [
        {
          "date": "2023 − Heden",
          "text": "Bachelor Elektronica − ICT in Vives"
        },
        {
          "date": "2022 − 2023",
          "text": "Programming@home in Howest"
        },
        {
          "date": "2021 − 2023",
          "text": "Diploma secundair Industriële ICT in KTA Brugge"
        },
        {
          "date": "2019 − 2021",
          "text": "Wetenschappen wiskunde in Sint-Jozef Humaniora"
        },
        {
          "date": "2017 − 2019",
          "text": "Wetenschappen STEM in Sint-Pieter Oostkamp"
        }
      ]
    },
    "section3": {
      "title": "Ervaring",
      "list": [
        {
          "date": "Mei 2023",
          "text": "Stage — 2 weken",
          "description": "Ontwikkelde een geautomatiseerd systeem om productafbeeldingen vast te leggen met 3 verschillende camera's voordat ze werden verpakt voor verzending. Gebruikte Python en OpenCV voor beeldverwerking; de afbeeldingen werden als PDF's op een server opgeslagen.",
          "location": "Advionics — Brugge, België"
        },
        {
          "date": "Zomer 2023",
          "text": "Studentenjob",
          "description": "Assisteerde bij het meten en kalibreren van industriële machines die werden gebruikt voor productapparatuur.",
          "location": "Advionics — Brugge, België"
        },
        {
          "date": "April 2024",
          "text": "Studentenjob",
          "description": "Bij deze studentenjob werkte ik opnieuw bij Advionics. Ik kreeg de taak om meerdere warmte sensoren uit te lezen en bepaalde acties te ondernemen als de temperatuur te hoog of te laag was. Ik schreef hiervoor een programma in Python.",
          "link": {
            "text": "Meer informatie",
            "url": "https://github.com/SimonStnn/mlx90640"
          },
          "location": "Advionics — Brugge, België"
        },
        {
          "date": "Zomer 2024",
          "text": "Studentenjob",
          "description": "Samenwerkte aan het herschrijven van interne testsoftware met Flask en Python. Geïmplementeerd containerization met Docker, waardoor de software in geïsoleerde omgevingen kon draaien, wat de implementatie en het testen vereenvoudigde.",
          "location": "Advionics — Brugge, België"
        }
      ]
    },
    "section4": {
      "title": "Talen",
      "languages": [
        {
          "language": "Nederlands",
          "level": "Moedertaal"
        },
        {
          "language": "Engels",
          "level": "Vloeiend"
        },
        {
          "language": "Frans",
          "level": "Gemiddeld"
        }
      ]
    }
  },
  "projects": {
    "title": "Projecten",
    "text": {
      "intro": "Hier zijn enkele projecten waaraan ik heb gewerkt. Sommigen van hen zijn open source, andere niet.",
      "end": "Ik werk meestal aan grotere projecten, waarvan de meeste hier zijn opgenomen. Ik bouw ook kleinere projecten, maar die deel ik hier niet."
    },
    "card": {
      "popaloon": {
        "content1": "\"Pop-a-loon\" is een leuke en interactieve Chrome-extensie waarbij af en toe een ballon willekeurig over je scherm zweeft. Als je op de ballon klikt, knalt deze met een bevredigende plof en verdwijnt. Het totale aantal ballonnen dat je hebt laten knappen, wordt bijgehouden en weergegeven in de pop-up van de extensie.",
        "content2": "De pop-up bevat ook een leaderboard met de top ballonknappers wereldwijd, samen met een voortgangsgrafiek die je knalgeschiedenis over de tijd visualiseert, zodat je jouw vooruitgang kunt bijhouden en het tegen anderen kunt opnemen."
      },
      "popaloonBackend": {
        "content1": "Dit is de backend-API voor de Pop-a-loon Chrome-extensie. Het is gebouwd met Node.js en Express. Het gebruikt een MongoDB-database om het aantal ballonnen dat door elke gebruiker is geknapt, op te slaan.",
        "content2": "Ik host en beheer de server zelf. De server staat achter een omgekeerde proxy, die wordt beheerd door Nginx."
      },
      "finalProject": {
        "title": "Eindwerk",
        "content": "Voor mijn eindwerk op de middelbare school (2022 - 2023) heb ik een bluetooth-detectiesysteem gebouwd dat bluetooth-apparaten in een kamer kan lokaliseren. Gedetecteerde apparaten worden via HTTP naar een server (Raspberry Pi) gestuurd. De server berekent vervolgens de locatie van het gevonden apparaat in de kamer. Deze informatie wordt daarna via een websocket weergegeven in een React-app. Het systeem heeft een geavanceerde structuur om het eenvoudig te maken om nieuwe functies toe te voegen."
      },
      "discordBot": {
        "title": "Discord Bot",
        "content": "Ik heb een discord-bot gebouwd met node.js en discord.js. Het is geschreven in TypeScript en maakt gebruik van een MongoDB-database."
      },
      "colorsplash": {
        "content": "Een simpele API die een afbeelding geeft van de gevraagde kleur en grootte."
      },
      "oddAndEven": {
        "odd": {
          "content": "Een Go packet die kijkt als een getal oneven is."
        },
        "even": {
          "content": "Een Go packet die kijkt als een getal even is."
        }
      },
      "other": {
        "title": "Andere Projecten",
        "content": "Ik heb ook een aantal closed source-projecten gebouwd, maar ik kan ze hier niet delen. Ik heb een prometheus-exporteur gemaakt, die naar grafana pusht. Ik ben ook bezig met een API. Het slaat ook de afbeeldingen en andere noodzakelijke gegevens op in een pdf."
      }
    }
  }
}
