{
  "navbar": {
    "home": "Home",
    "about": "Over mij",
    "projects": "Projecten",
    "changeTheme": {
      "title": "Verander thema",
      "light": "Licht",
      "dark": "Donker",
      "pink": "Roze",
      "system": "Systeem"
    },
    "changeLanguage": {
      "title": "Verander taal",
      "en": "Engels",
      "nl": "Nederlands"
    }
  },
  "index": {
    "header": {
      "title": {
        "section1": "Welkom op",
        "section2": "persoonlijke website!"
      },
      "slogan": "Hallo daar! Ik ben Simon Stijnen, een gepassioneerde ontwikkelaar gevestigd in België."
    },
    "section1": {
      "title": "Leer mij kennen",
      "text_1": "Ik ben een ",
      "text_2": "- jarige ontwikkelaar uit België. Momenteel studeer ik aan Vives Brugge.",
      "button": "Leer mij kennen"
    },
    "section2": {
      "title": "Websites van mijn getalenteerde vrienden presenteren. Ontdek hun werk!",
      "text": "Momenteel ben ik bezig met een aantal projecten. Je kunt ze allemaal vinden op mijn Github-pagina.",
      "accordion": {
        "maxim": "is een vriend van mij die ook ontwikkelaar is. Momenteel studeert hij aan Odisee in Gent.",
        "joe1": "Maak kennis met ",
        "joe2": ", mijn studiemaatje aan Vives Brugge."
      },
      "footer": "Ze zijn echt getalenteerd en ik ben er trots op dat ik ze mijn vrienden mag noemen."
    },
    "section3": {
      "title": "",
      "text": "Kijk gerust eens rond en neem gerust contact met ons op. Ik wil altijd graag in contact komen met gelijkgestemde individuen en nieuwe kansen verkennen. Bedankt voor uw bezoek, en ik hoop dat u geniet van uw verblijf!"
    }
  },
  "about": {
    "section1": {
      "title": "Persoonlijke informatie",
      "birthday": "23 maart 2005",
      "livingIn": "Komt uit België",
      "studies": "Momenteel een Bachelor Elektronica − ICT aan het studeren in Vives",
      "hobby": "Ijshockey speler @"
    },
    "section2": {
      "title": "Studies",
      "studies": [
        {
          "date": "2023 − Heden",
          "text": "Bachelor Elektronica − ICT in Vives"
        },
        {
          "date": "2022 − 2023",
          "text": "Programming@home in Howest"
        },
        {
          "date": "2021 − 2023",
          "text": "Diploma secundair Industriële ICT in KTA Brugge"
        },
        {
          "date": "2019 − 2021",
          "text": "Wetenschappen wiskunde in Sint-Jozef Humaniora"
        },
        {
          "date": "2017 − 2019",
          "text": "Wetenschappen STEM in Sint-Pieter Oostkamp"
        }
      ]
    },
    "section3": {
      "title": "Ervaring",
      "list": [
        {
          "date": "Mei  2023",
          "text": "Stage 2 weken",
          "description": "Voor mijn stage in het 6de middelbaar heb ik stage gelopen bij Advionics. Hier maakte ik een programma dat automatisch foto's neemt van het product met 3 verschillende camera's van hun product, net voor het in de doos gaat voor verzending. De foto's worden dan opgeslagen in een pdf op een server. Hiervoor gebruikte ik Python en OpenCV voor foto bewerking. Beide leerde ik niet op school, maar ik heb ze mezelf aangeleerd."
        },
        {
          "date": "Zomer 2023",
          "text": "Studentenjob",
          "description": "Voor mijn studentenjob heb ik bij Advionics gewerkt. Hier hielp ik met het meten van hun machines die apparatuur kalibreerden. Ik heb bijvoorbeeld de foutmarge van elke machine gemeten."
        },
        {
          "date": "Mei 2024",
          "text": "Studentenjob",
          "description": "Bij deze studentenjob werkte ik weer bij Advionics. Ik kreeg de opdracht om verschillende warmte sensoren uit te lezen en bepaalde acties te ondernemen als de temperatuur te hoog of te laag was. Ik heb hiervoor een programma geschreven in Python.",
          "link": {
            "text": "Meer informatie",
            "url": "https://github.com/SimonStnn/mlx90640"
          }
        },
        {
          "date": "Zomer 2024",
          "text": "Studentenjob",
          "description": "Ik werkte opnieuw bij Advionics. Hier hielp ik hun test software herschrijven. Deze werd geschreven in Python m.b.v. Flask. Ik zorgde er ook voor dat dit project containerized werd met Docker."
        }
      ]
    }
  },
  "projects": {
    "title": "Projecten",
    "text": {
      "intro": "Hier zijn enkele projecten waaraan ik heb gewerkt. Sommigen van hen zijn open source, andere niet.",
      "end": "Ik werk meestal aan grotere projecten, waarvan de meeste hier zijn opgenomen. Ik bouw ook kleinere projecten, maar die deel ik hier niet."
    },
    "card": {
      "popaloon": {
        "content1": "\"Pop-a-loon\" is een Chrome-extensie die ik heb gebouwd en die af en toe een ballon over het scherm laat zweven. Wanneer je op de ballon klikt, knalt hij en verdwijnt hij. Het aantal ballonnen dat je hebt laten knappen, wordt weergegeven in het pop-upvenster van de extensie.",
        "content2": "Het pop-upvenster van de extensie bevat ook een leaderboard, waar je de top 10 ballonnenknallers kunt zien."
      },
      "popaloonBackend": {
        "content1": "Dit is de backend-API voor de Pop-a-loon Chrome-extensie. Het is gebouwd met Node.js en Express. Het gebruikt een MongoDB-database om het aantal ballonnen dat door elke gebruiker is geknapt, op te slaan.",
        "content2": "Ik host en beheer de server zelf. De server staat achter een omgekeerde proxy, die wordt beheerd door Nginx."
      },
      "finalProject": {
        "title": "Eindwerk",
        "content": "Voor mijn eindwerk op de middelbare school (2022 - 2023) heb ik een bluetooth-detectiesysteem gebouwd dat bluetooth-apparaten in een kamer kan lokaliseren. Gedetecteerde apparaten worden via HTTP naar een server (Raspberry Pi) gestuurd. De server berekent vervolgens de locatie van het gevonden apparaat in de kamer. Deze informatie wordt daarna via een websocket weergegeven in een React-app. Het systeem heeft een geavanceerde structuur om het eenvoudig te maken om nieuwe functies toe te voegen."
      },
      "discordBot": {
        "title": "Discord Bot",
        "content": "Ik heb een discord-bot gebouwd met node.js en discord.js. Het is geschreven in TypeScript en maakt gebruik van een MongoDB-database."
      },
      "colorsplash": {
        "content": "Een simpele API die een afbeelding geeft van de gevraagde kleur en grootte."
      },
      "oddAndEven": {
        "odd": {
          "content": "Een Go packet die kijkt als een getal oneven is."
        },
        "even": {
          "content": "Een Go packet die kijkt als een getal even is."
        }
      },
      "other": {
        "title": "Andere Projecten",
        "content": "Ik heb ook een aantal closed source-projecten gebouwd, maar ik kan ze hier niet delen. Ik heb een prometheus-exporteur gemaakt, die naar grafana pusht. Ik ben ook bezig met een API. Het slaat ook de afbeeldingen en andere noodzakelijke gegevens op in een pdf."
      }
    }
  }
}
